In [92]:
import pandas as pd
import numpy as np

afuera=['G1','G2','G1','G2','G1','G2']
adentro=[1,2,3,1,2,3]
indices= list(zip(afuera, adentro))
indices
indices = pd.MultiIndex.from_tuples(indices)
indices

MultiIndex(levels=[[u'G1', u'G2'], [1, 2, 3]],
           labels=[[0, 1, 0, 1, 0, 1], [0, 1, 2, 0, 1, 2]])

In [93]:
# checamos
type(indices)

pandas.core.indexes.multi.MultiIndex

In [94]:
from numpy.random import randn
df = pd.DataFrame(randn(6,2), indices, ['A','B']) # cabeceras AB, los indices es Muti-index

In [95]:
df

             A         B
G1 1  0.977241 -0.280677
G2 2 -0.552886  1.061714
G1 3  1.041696 -0.951152
G2 1  0.099516 -1.716037
G1 2  1.604054 -1.207871
G2 3  0.582599  0.093808

In [96]:
df.loc['G1'].loc[1] # loc es la linea, toda la capa

A    0.977241
B   -0.280677
Name: 1, dtype: float64

In [97]:
# un solo valor
df.loc['G2'].loc[3]['B']

0.093808148628056878

In [98]:
# Método sección cruzada (cross section) TODO
df.xs('G1')

          A         B
1  0.977241 -0.280677
3  1.041696 -0.951152
2  1.604054 -1.207871

In [99]:
#---
df.xs(1,level=1)

           A         B
G1  0.977241 -0.280677
G2  0.099516 -1.716037

Datos perdidos

In [3]:
#df.xs(1,level='Num' )

In [19]:
import numpy as np

In [20]:
import pandas as pd

In [21]:
d={'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C':[1,2,3]}   #Diccionario

In [22]:
df = pd.DataFrame(d)

In [23]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [24]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [25]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [26]:
df.dropna(thresh=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [27]:
df.fillna(value='rellenar')

          A         B  C
0         1         5  1
1         2  rellenar  2
2  rellenar  rellenar  3

In [28]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [29]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [30]:
df['A'].fillna(value=df['A'].mean(), inplace=True)

In [31]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [32]:
df['B'].fillna(value=df['B'].mean())

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

In [33]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

Agrupar alias joins

In [34]:
data= {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Jose','Amy','Ray','Carl','Christian'],
       'Sales':[200,120,340,124,243,350]}

In [35]:
df=pd.DataFrame(data)

In [36]:
df

  Company     Person  Sales
0    GOOG        Sam    200
1    GOOG       Jose    120
2    MSFT        Amy    340
3    MSFT        Ray    124
4      FB       Carl    243
5      FB  Christian    350

In [37]:
df.groupby('Company')

In [38]:
byCom= df.groupby('Company')

In [39]:
byCom

In [40]:
byCom.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [42]:
byCom.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [43]:
byCom.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [44]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [46]:
df.groupby('Company').max()

            Person  Sales
Company
FB       Christian    350
GOOG           Sam    200
MSFT           Ray    340

In [47]:
df.groupby('Company').min()

        Person  Sales
Company
FB        Carl    243
GOOG      Jose    120
MSFT       Amy    124

In [48]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [49]:
df.describe()

            Sales
count    6.000000
mean   229.500000
std    100.899455
min    120.000000
25%    143.000000
50%    221.500000
75%    315.750000
max    350.000000

In [50]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [51]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64

In [52]:
df.groupby('Company').describe().transpose()['MSFT']

Sales  count      2.000000
       mean     232.000000
       std      152.735065
       min      124.000000
       25%      178.000000
       50%      232.000000
       75%      286.000000
       max      340.000000
Name: MSFT, dtype: float64

Concatenaciones

In [62]:
df1 = pd.DataFrame({'A':['A0','A1','A2','A3'],
                    'B':['B0','B1','B2','B3'],
                    'C':['C0','C1','C2','C3'],
                    'D':['D0','D1','D2','D3']},
                    index = [0,1,2,3])

In [61]:
df2 = pd.DataFrame({'A':['A4','A5','A6','A7'],
                    'B':['B4','B5','B6','B7'],
                    'C':['C4','C5','C6','C7'],
                    'D':['D4','D5','D6','D7']},
                    index = [4,5,6,7])

In [60]:
df3 = pd.DataFrame({'A':['A8','A9','A10','A11'],
                    'B':['B8','B9','B10','B11'],
                    'C':['C8','C9','C10','C11'],
                    'D':['D8','D9','D10','D11']},
                    index = [8,9,10,11])

In [63]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [64]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [65]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [66]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [67]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [69]:
pd.concat([df1,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [70]:
izquierdo = pd.DataFrame({'Key':['K0','K1','K2','K3'],
                          'A':['A0','A1','A2','A3'],
                          'B':['B0','B1','B2','B3'],})

In [71]:
derecho = pd.DataFrame({'Key':['K0','K1','K2','K3'],
                          'C':['C0','C1','C2','C3'],
                          'D':['D0','D1','D2','D3'],})

Merge

In [72]:
pd.merge(izquierdo, derecho, how='inner', on='Key')

    A   B Key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [74]:
izquierdo = pd.DataFrame({
                          'A':['A0','A1','A2'],
                          'B':['B0','B1','B2']},
                          index = ['K0','K1','K2'])

In [81]:
derecho = pd.DataFrame({
                          'C':['C0','C1','C2'],
                          'D':['D0','D1','D2']},
                          index = ['K0','K2','K3'])

In [82]:
izquierdo.join(derecho)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

operaciones

In [85]:
df = pd.DataFrame({ 'col':[1,2,3,4],
                    'col2':[444,555,444,666],
                    'col3':['abc','def','ghi','xyz']})

In [86]:
df.head

<bound method DataFrame.head of    col  col2 col3
0    1   444  abc
1    2   555  def
2    3   444  ghi
3    4   666  xyz>

In [87]:
df['col2'].unique()

array([444, 555, 666])

In [88]:
len(df['col2'].unique())

3

In [89]:
df['col2'].nunique()

3

In [90]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [101]:
def multiplica2(x):
     return x*2

In [102]:
# programacion funcional en python
df.apply(multiplica2)

             A         B
G1 1  1.954482 -0.561354
G2 2 -1.105773  2.123429
G1 3  2.083393 -1.902304
G2 1  0.199032 -3.432074
G1 2  3.208108 -2.415742
G2 3  1.165197  0.187616

In [103]:
# CIERRE, lambda es funcion anonima, x son todos los elementos
df.apply(lambda x: x*2)# CIERRE, lambda es funcion anonima, x son todos los elementos
df.apply(lambda x: x*2)

             A         B
G1 1  1.954482 -0.561354
G2 2 -1.105773  2.123429
G1 3  2.083393 -1.902304
G2 1  0.199032 -3.432074
G1 2  3.208108 -2.415742
G2 3  1.165197  0.187616